from random import randint


alef_poems = ["از آن، زمانه بما ایستادگی آموخت که تا ز پای نیفتیم، تا که پا و سریست", "از آن، دراز نکردم سخن درین معنی که کار زندگی لاله کار مختصریست", "ای خوشا مستانه سر در پای دلبر داشتن دل تهی از خوب و زشت چرخ اخضر داشتن"]
be_poems = ["به لاله نرگس مخمور گفت وقت سحر که هر که در صف باغ است صاحب هنریست", "بنفشه مژدهٔ نوروز میدهد ما را شکوفه را ز خزان وز مهرگان خبریست", "بجز رخ تو که زیب و فرش ز خون دل است بهر رخی که درین منظر است زیب و فریست"]
pe_poems = ["پرید از شاخکی بر شاخساری | گذشت از بامکی بر جو کناری", "پریدن بی پر تدبیر، مستی است | جهان را گه بلندی، گاه پستی است", "پروین، نشان دوست درستی و راستی است | هرگز نیازموده، کسی را مدار دوست"]
te_poems = ["تا خیمهٔ وجود من افراشت بخت گفت کاز بهر واژگون شدنش برفراختم", "تا خفت ز خستگی زمانی | یغماگر دهر گشت بیدار", "تو غرق سیم و زر و من ز خون دل رنگین | بفقر خلق چه خندی، تو را که سیم و زریست"]
se_poems = []
jim_poems = ["جامه‌ات شوخ است و رویت تیره رنگ از گرد و خاک | از تو میبایست کردن اجتناب ای رنجبر", "جز من که دستم از همه چیز جهان تهیست | هر کس که بود، برگ زمستان خود خرید", "جمله آنان را که چون زالو مکندت خون بریز | وندران خون دست و پائی کن خضاب ای رنجبر"]
che_poems = ["چون بال و پرش تپید در خون | از یاد برون شدش پریدن", "چون دید هیچ نیست فکندش بخاک و رفت | زینسانش آزمود! چه نیک آزمودنی", "چون شانه، عیب خلق مکن موبمو عیان | در پشت سر نهند کسی را که عیبجوست"]
heh_poems = ["حاکم شرعی که بهر رشوه فتوی میدهد | کی دهد عرض فقیران را جواب ای رنجبر",]
khe_poems = ["خاری بطعنه گفت چه حاصل ز بو و رنگ | خندید گل که هرچه مرا هست رنگ و بوست", "خون ریخت بکام کودکی چند | برچید بساط مادری را", "خوش است اگر گل امروز خوش بود فردا | ولی میان ز شب تا سحر گهان اگریست"]
dal_poems = ["دیگر ز نرد هستیم امید برد نیست | کاز طاق و جفت، آنچه مرا بود باختم", "دانا نجست پرتو گوهر ز مهره‌ای | عاقل نخواست پاکی جان خوش از تنی", "در دهر بس کتاب و دبستان بود، ولیک | درس ادیب را چکند طفل کودنی"]
zal_poems = []
re_poems = ["روزی گذشت پادشهی از گذرگهی | فریاد شوق بر سر هر کوی و بام خاست"]
ze_poems = ["زینهمه خواری که بینی زافتاب و خاک و باد | چیست مزدت جز نکوهش یا عتاب ای رنجبر", "ز اندوه دیر گشتن اندود بام خویش | هر گه که ابر دیدم و باران، دلم طپید", "زانکس که نام خلق بگفتار زشت کشت | دوری گزین که از همه بدنامتر هموست"]
zhe_poems = ["خندید گل که دیر شد این بخشش و عطا | رخساره‌ای نماند، ز گرما گداختم", "خندید مرغ و گفت که با این فروغ و رنگ | بفروشمت اگر بخرد کس، به ارزنی", "خواندش گهر به پیش که من لعل روشنم | روزی باین شکاف فتادم ز گردنی"]
sin_poems = ["سیلابهای حادثه بسیار دیده‌ام | سیل سرشک زان سبب از دیده‌ام دوید", "سوختن بگداختن چون شمع و بزم افروختن | تن بیاد روی جانان اندر آذر داشتن",]
shin_poems = ["شاهین حوادثش فرو برد | نشنید حدیث مهر مادر", "شد ساقی چرخ پیر خرسند | پردید ز خون چو ساغری را", "شد چهرهٔ زندگی دگرگون | در دیده نماند تاب دیدن"]
sad_poems = ["صیاد سیه دل از کمین جست | تا صید ضعیف گشت بیجان",]
zad_poems = []
ta_poems = ["طفلان بخیال آب و دانه | خفتند و نخاست دیگر آواز",]
za_poems = []
ein_poems = ["علامت خطر است این قبای خون آلود | هر آنکه در ره هستی است در ره خطریست",]
ghein_poems = []
fe_poems = ["فتاد از پای و کرد از عجز فریاد | ز شاخی مادرش آواز در داد",]
ghaf_poems = ["قدح از لاله بگیرد نرگس | همه جا ساغر و صهبائی هست",]
kaf_poems = ["کبوتر بچه‌ای با شوق پرواز | بجرئت کرد روزی بال و پر باز", "کزینسان است رسم خودپسندی | چنین افتند مستان از بلندی"]
gaf_poems = ["گفت رازی که نهان است ببین | اگرت دیدهٔ بینائی هست", "گر که منظور تو زیبائی ماست | هر طرف چهرهٔ زیبائی هست", "گفت فردا به گلستان باز آی | تا ببینی چه تماشائی هست"]
lam_poems = []
mim_poems = ["منظور و مقصدی نشناسد به جز جفا | من با یکی نظاره، جهان را شناختم", "مرغی نهاد روی بباغی ز خرمنی | ناگاه دید دانهٔ لعلی به روزنی", "ما را فکند حادثه‌ای، ورنه هیچگاه | گوهر چو سنگریزه نیفتد به برزنی"]
non_poems = ["ناسازگاری از فلک آمد، وگرنه من | با خاک خوی کردم و با خار ساختم", "ننواخت هیچگاه مرا، گرچه بیدریغ | هر زیر و بم که گفت قضا، من نواختم", "نزدیک رفت پیرزنی گوژپشت و گفت | این اشک دیدهٔ من و خون دل شماست"]
vav_poems = ["وقت سحر، به آینه‌ای گفت شانه‌ای | کاوخ! فلک چه کجرو و گیتی چه تند خوست",]
he_poems = ["هم از امروز سخن باید گفت | که خبر داشت که فردائی هست", "هیچکس را سر بدخوئی نیست | همه را میل مدارائی هست", "هنگام صبح در عوض پرده، عنکبوت | بر بام و سقف ریخته‌ام تارها تنید"]
ye_poems = ["یک جای وصله در همهٔ جامه‌ام نماند | زین روی وصله کردم، از آن رو ز هم درید", "یکی نظر به گل افکند و دیگری بگیاه | ز خوب و زشت چه منظور؟ هر که را نظریست"]


def get_random_poem(starter_letter: str) -> str:
    poems = {
        "ء": alef_poems, "أ": alef_poems, "آ": alef_poems, "ا": alef_poems,
        "ب": be_poems, "پ": pe_poems, "ت": te_poems, "ث": se_poems,
        "ج": jim_poems, "چ": che_poems, "ح": heh_poems, "خ": khe_poems,
        "د": dal_poems, "ذ": zal_poems, "ر": re_poems, "ز": ze_poems,
        "ژ": zhe_poems, "س": sin_poems, "ش": shin_poems, "ض": zad_poems,
        "ص": sad_poems, "ط": ta_poems, "ظ": za_poems, "ع": ein_poems,
        "غ": ghein_poems, "ف": fe_poems, "ق": ghein_poems, "ک": kaf_poems,
        "گ": gaf_poems, "ل": lam_poems, "م": mim_poems, "ن": non_poems,
        "و": vav_poems, "ه": he_poems, "ی": ye_poems,
    }
    if starter_letter in poems:
        selected_poems = poems[starter_letter]
        if selected_poems:
            return selected_poems[randint(0, len(selected_poems))]


def poetry(verse: str) -> str:
    last_letter = verse[-1]
    return get_random_poem(last_letter) or "Null"


print(poetry("ر"))